2020-09-04-relm-on-windows.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2021-01-26 Tue 23:09 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Rust and Gtk on Windows</title>
<meta name="generator" content="Org mode">
<meta name="author" content="Peter Tillemans">
<link rel="stylesheet" href="css/site.css"
  type="text/css"/>
</head>
<body>
<div id="preamble" class="status">
<div class="nav">
<ul>
<li><a href="/">Home</a></li>
<li><a href="https://github.com/ptillemans">GitHub</a></li>
</ul>
</div>
</div>
<div id="content">
<header>
<h1 class="title">Rust and Gtk on Windows</h1>
</header><nav id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#installing-gtk-in-msys2mingw64">1. Installing Gtk in Msys2/Mingw64</a></li>
<li><a href="#preparing-rust-and-cargo">2. Preparing rust and cargo</a></li>
<li><a href="#using-vscode">3. Using VSCode</a></li>
</ul>
</div>
</nav>
<p>
There are essentially 2 methods for compiling Gtk apps
</p>

<ul class="org-ul">
<li>using <i>msvc</i> compiler and .LIB files</li>
<li>using "gnu" backend and msys2 libraries</li>
</ul>

<p>
It is a pick your poison situation, the first option requires unpacking
zip files and organizing stuff so the rust compiler can find the
libraries and the runtime the DLLs.
</p>

<p>
The other option requires configuring rust to essentially cross compile
to the <i>x86<sub>64</sub>-pc-windows-gnu</i> target.
</p>

<p>
Since I know how to cross compile from my recent experiments with
compiling for embedded ARM processors and I generally know my way better
around the unixy msys environment, the latter it is.
</p>

<div id="outline-container-org3cee83b" class="outline-2">
<h2 id="installing-gtk-in-msys2mingw64"><a id="org3cee83b"></a><span class="section-number-2">1</span> Installing Gtk in Msys2/Mingw64</h2>
<div class="outline-text-2" id="text-installing-gtk-in-msys2mingw64">
<p>
Installing gtk3 is easy as it can be installed with <i>pacman</i>
</p>

<pre class="example">
$ pacman -S mingw64/mingw-w64-x86_64-gtk3
</pre>

<p>
Add some support for integrating with c libraries and linking, etc&#x2026;
</p>

<pre class="example">
$ pacman -S mingw-w64-x86_64-toolchain base-devel
</pre>

<p>
Being optimistic I installed glade. Probably wont need it today but it
is a good test to see if Gtk apps at least start.
</p>

<pre class="example">
$ pacman -S mingw-w64-x86_64-glade
</pre>

<p>
Glade starts and shows the GUI so the first milestone was reached.
</p>
</div>
</div>

<div id="outline-container-org2dded6c" class="outline-2">
<h2 id="preparing-rust-and-cargo"><a id="org2dded6c"></a><span class="section-number-2">2</span> Preparing rust and cargo</h2>
<div class="outline-text-2" id="text-preparing-rust-and-cargo">
<p>
First install the cross compilation target
</p>

<pre class="example">
$ rustup target add x86_64-pc-windows-gnu
</pre>

<p>
I can now compile with
</p>

<pre class="example">
$ PKG_CONFIG_ALLOW_CROSS=1 cargo build --target=x86_64-pc-windows-gnu
</pre>

<p>
To always enably this environment variable in the project folder I added
a <i>.env</i> file with
</p>

<pre class="example">
PKG_CONFIG_ALLOW_CROSS=1
</pre>

<p>
which is picked up by the zsh dotenv plugin when I enter the folder.
</p>

<p>
Similarly we can change the default target for cargo with adding
</p>

<pre class="example">
build]
target = "x86_64-pc-windows-gnu"
</pre>

<p>
to *.cargo/config.toml
</p>

<p>
We can now simply do
</p>

<pre class="example">
$ rust build
</pre>

<p>
or
</p>

<pre class="example">
$ rust run
</pre>
</div>
</div>

<div id="outline-container-org5d1ed22" class="outline-2">
<h2 id="using-vscode"><a id="org5d1ed22"></a><span class="section-number-2">3</span> Using VSCode</h2>
<div class="outline-text-2" id="text-using-vscode">
<p>
When using <i>vscode</i> the rust language server needs to have this
enviroment setup too so it can do its magic. For debugging and running
you can do this in <i>launch.json</i> by setting the variables in the <i>env</i>
property, but this is (logically) not used for the language server.
There seem no way to have <i>vscode</i> respect the <i>.env</i> file soon enough
for the language server to pick it up.
</p>

<p>
The solution I settled on was to launch <i>vscode</i> from the command line
in the project folder:
</p>

<pre class="example">
$ code .
</pre>

<p>
The prompt returns immediately and <i>vscode</i> is seeing the same
environment as the shell. (This does imply that the vscode bin directory
is on the path.)
</p>

<p>
Of course this wisdom was gained by fixing 1 error message after another
while trying to build an example in a 2018 blogpost. In hindsight I
could have started with the examples provided with the relm sourcecode,
but where would be the fun in that?
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<div class="footer"> Copyright 2020 Peter Tillemans (<a href="http://validator.w3.org/check?uri=referer">Validate</a>
  HTML).<br> Last updated 2021-01-26 Tue 23:09.<br> Built with <a href="https://www.gnu.org/software/emacs/">Emacs</a> 26.3 (<a href="https://orgmode.org">Org</a> mode 9.1.9).  </div>
</div>
</body>
</html>
